DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-time-weather/src/main.cpp
/***************************************************
ESP32 Badge Time and Weather Display

Requires:
 - DS3231 Real Time Clock breakout
 - BME280 Temperature, pressure, & humidity breakout
 - WiFi network and credentials

 Will operate in a degraded mode if any of the requirements are not available.

 Controls:
 - X/Y:         Cycle through display modes
 - A:           Enter / commit set time
 - Left/Right:  Move selection field
 - Up/Down:     Increase/decrease selection value

Copyright (c) 2020 Paul Pagel
This is free software; see the license.txt file for more information.
There is no warranty; not even for merchantability or fitness for a particular purpose.
*****************************************************/

#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ILI9341.h>
#include <XPT2046_Touchscreen.h>
#include <Fonts/FreeMonoBold12pt7b.h> 
#include <Fonts/FreeSansBold18pt7b.h> 
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>  // ArduinoJson by Benoit Blanchon
#include "time.h"
#include "esp32_r4ge_pro.h"
#include "DS3231_RTC.h"
#include "SparkFunBME280.h"
#include "TFT_Helper.h"
#include "icons.h"

#define BADGE_WIFI_MODE  WIFI_MODE_AP // use WIFI_MODE_STA (station) for home WiFi, WIFI_MODE_AP (access point) when using mobile hotspot

const char*    ssid     = "TODO"; // TODO: add your network ID here 
const char*    password = "TODO"; // TODO: add your network password here 

/*  To customize: 
 *   1.  Go to https://www.weather.gov/documentation/services-web-api
 *   2.  Enter your zipcode and click the Go button
 *   3.  Copy the lat/long values from the resulting URL, i.e. lat=41.40137000000004&lon=-82.70880605999997
 *       and past them into this URL:  https://api.weather.gov/points/<lat>,<lon>
 *       example for Sandusky, OH:  https://api.weather.gov/points/41.40137000000004,-82.70880605999997
 *   4.  Copy the value of the properties->forecast node to the forecast_api_url assignment below:      
 */   
const char*    forecast_api_url = "https://api.weather.gov/gridpoints/CLE/48,56/forecast ";  // TODO: change this for your city
//const char*    forecast_api_url = "https://api.weather.gov/gridpoints/CLE/19,62/forecast?units=us";  // Perrysburg, OH

#define FORECAST_REFRESH_MS       3600000  // 1 hr
#define BME280_I2C_ADDR           0X76     // default address for BME280 is 0x77, mine was set to 0x76

// Display element color settings
#define COLOR_SCREEN_BGD          ILI9341_BLACK
#define COLOR_DATE                ILI9341_ORANGE
#define COLOR_TIME                ILI9341_BLACK
#define COLOR_TIME_BGD            ILI9341_ORANGE
#define COLOR_TIME_EDIT           ILI9341_BLUE
#define COLOR_SENSOR_LINES        ILI9341_DARKGREY
#define COLOR_SENSOR_TEMP         ILI9341_LIGHTGREY
#define COLOR_SENSOR_HUMID        ILI9341_CYAN
#define COLOR_SENSOR_PRESSURE     ILI9341_BLUE
#define COLOR_FORECAST_TEMP       ILI9341_GREEN
#define COLOR_FORECAST_TITLE      ILI9341_BLACK
#define COLOR_FORECAST_TITLE_BGD  ILI9341_GREEN
#define COLOR_FORECAST_BODY       ILI9341_DARKGREY

#define SCREEN_ROWS_MONO12       9
#define SCREEN_COLS_MONO12      22

// Calculates the screen X position for the given time digit 
// digit index values:  0 = h1, 1=h2, 2=m1, 3=m2, 4=s1, 5=s2
#define TIME_DIGIT_X(digit)       (20 + (digit) * 38 + ((digit) > 1 ? 20 : 0) + ((digit) > 3 ? 20 : 0))

const uint16_t net_connect_timeout_sec = 10;
const char*   ntp_server = "pool.ntp.org";
// TODO: change this if you are not in the Eastern US time zone
const long    gmt_offset_sec = -18000;      // EST GMT-5 * 3600 seconds per hour
const int     daylight_offset_sec = 3600;   // Set to 0 if your region does not observe DST

bool wifi_available, ds3231_available, bme280_available;  

#define DISPLAY_MODE_CNT  4
enum display_mode_type 
{
  MODE_TIME_AND_SENSOR,
  MODE_DAY_FORECAST,
  MODE_TOMORROW_FORECAST,
  MODE_SET_TIME
};
enum display_mode_type display_mode, prev_display_mode;

struct ds3231_time_t curr_time;
DS3231_RTC rtc = DS3231_RTC();
BME280 sensor;

// Use https://arduinojson.org/v5/assistant/ to find appropriate JSON memory size
StaticJsonDocument<15000> json_doc; // holds the forecast from the weather API
unsigned long forecast_age_ms;    // # milliseconds elapsed since the forecast was retrieved
bool forecast_loaded = false;

bool btn_was_pressed[8], btn_pressed[8], btn_released[8];
uint8_t tft_led_bright = 64;

uint8_t curr_time_digits[6];
uint8_t prev_time_digits[6];
uint8_t prev_day;

int16_t curr_temp_f, curr_temp_c, curr_humid, curr_pressure, forecast_temp_f;
int16_t prev_temp_f, prev_temp_c, prev_humid, prev_pressure, prev_forecast_temp_f;

uint8_t spkr_channel = 1;

XPT2046_Touchscreen ts(TCH_CS);
Adafruit_ILI9341 tft = Adafruit_ILI9341(TFT_CS, TFT_DC, TFT_RST);

// Private function prototypes
void currTimeToDigits();
void digitsToCurrTime();
void readBME280();
bool connectToWiFi(uint16_t timeout_sec);
bool getForecast();
bool readControllerTime(struct ds3231_time_t *read_time);
void setControllerTime(ds3231_time_t set_time);
bool getNtpTime();
void beginTimeAndSensor();
void updateTimeAndSensor();
void beginDayForecast();
void updateDayForecast();
void beginTomorrowForecast();
void updateTomorrowForecast();
void beginSetTime();
void updateSetTime();
void checkButtonPresses();
void updateScreen();


void setup() 
{
  Serial.begin(9600);
  Serial.println("ESP32 R4ge Pro Time and Weather"); 
  delay(100);
  
   pinMode(ESP_LED, OUTPUT);  // built-in blue LED on NodeMCU

  // Set up shift register pins
  pinMode(SR_PL, OUTPUT);
  pinMode(SR_CP, OUTPUT);   
  pinMode(SR_Q7, INPUT);

  // Set up the SPI CS output pins
  pinMode(TFT_CS, OUTPUT);
  pinMode(TCH_CS, OUTPUT);
  pinMode(SD_CS, OUTPUT);

  pinMode(TFT_LED, OUTPUT);
  // Set up the TFT backlight brightness control
  //  Keep Hz out of audible range.  Lower does lead to visible flickering
  ledcSetup(TFT_LED_CHANNEL, 20000, 8);  // Hz max, 8 bit resolution.  
  ledcAttachPin(TFT_LED, TFT_LED_CHANNEL);
  ledcWrite(TFT_LED_CHANNEL, tft_led_bright);
  
  // Set up the joysticks
  pinMode(JOYX_L, INPUT);
  pinMode(JOYY_L, INPUT);
  pinMode(JOYX_R, INPUT);
  pinMode(JOYY_R, INPUT);

  // Set up the TFT screen
  tft.begin();
  tft.setRotation(SCREEN_ROT);

  ts.begin();
  ts.setRotation(TCHSCRN_ROT);

