DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-time-weather/src/main.cpp
  Wire.begin();  // fire up I2C

  // Initialize the BME280 sensor
  sensor.setI2CAddress(BME280_I2C_ADDR);    
  bme280_available = sensor.beginI2C();
  if (bme280_available == false)
  {
    Serial.println("The BME280 sensor did not respond. Check I2C wiring and address jumpers.");
    //digitalWrite(LED_1, HIGH);  // redlight!
  }

  // Check the DS3231 RTC
  ds3231_available = rtc.readDS3231time(&curr_time);
  if (ds3231_available == false)
  {
    Serial.println("The DS3231 RTC did not respond. Check I2C wiring and address jumpers.");
    //digitalWrite(LED_1, HIGH);  // redlight!
  }

  // Try to get the current local time from NTP server
  if (strlen(ssid) > 0)
  {
    wifi_available = getNtpTime();
    if (wifi_available)
    {
      getForecast();
    }
    else
    {
      Serial.println("Unable to get Network Time. Check network SSID and password.");
      //digitalWrite(LED_1, HIGH);  // redlight!
    }
  }
  else
  {
    Serial.println("No network SSID specified.");
    wifi_available = false;
  }
 
  
  display_mode = MODE_TIME_AND_SENSOR;
  beginTimeAndSensor();
}

/*
 * Store the current time value in hhmmss digit buffer array
 */
void currTimeToDigits()
{
  curr_time_digits[0] = curr_time.hour / 10;
  curr_time_digits[1] = curr_time.hour % 10;
  curr_time_digits[2] = curr_time.minute / 10;
  curr_time_digits[3] = curr_time.minute % 10;
  curr_time_digits[4] = curr_time.second / 10;
  curr_time_digits[5] = curr_time.second % 10;
}

/*
 * 
 */
void digitsToCurrTime()
{
  curr_time.hour = min(curr_time_digits[0] * 10 + curr_time_digits[1], 24); 
  curr_time.minute = min(curr_time_digits[2] * 10 + curr_time_digits[3], 59);
  curr_time.second = min(curr_time_digits[4] * 10 + curr_time_digits[5], 59); 
}

/*
 * Read temperature, humidity, and pressure sensor values from the BME280
 */
void readBME280()
{
  static uint16_t cntr = 0;

  if (cntr == 0)
  {
    curr_temp_f = (int16_t)sensor.readTempF();  
    curr_temp_c = (int16_t)sensor.readTempC();  
    curr_humid = (int16_t)sensor.readFloatHumidity();    
    float pressure = sensor.readFloatPressure() * 0.0002952998751f;  // kPa to inHg
    curr_pressure = (int16_t)(pressure); 
  }
  cntr = (cntr + 1) % 100;  // check every 100th time this is called
}

/*
 * Connects the configured WiFi network
 */
bool connectToWiFi(uint16_t timeout_sec)
{
  uint16_t elapsed_sec = 0;

  Serial.printf("Connecting to %s ", ssid);
  //digitalWrite(LED_1, LOW);  // reset error indicator

  WiFi.mode(BADGE_WIFI_MODE);
  delay(500);
  WiFi.begin(ssid, password);
  
  while ((WiFi.status() != WL_CONNECTED) && (elapsed_sec < timeout_sec)) 
  {
    digitalWrite(ESP_LED, HIGH);
    delay(500);
    Serial.print(".");
    digitalWrite(ESP_LED, LOW);
    delay(500);
    elapsed_sec += 1;
  }
  Serial.println();
  
  //if (WiFi.status() != WL_CONNECTED)
  if (elapsed_sec >= timeout_sec)
  {
    //digitalWrite(LED_1, HIGH); // red=problem 
    Serial.println("Network connection timeout.");
    wifi_available = false;
    return false;  // failure 
  }

  wifi_available = true;
  return true; // success
}

/*
 * Get the forecast data from the National Weather Service API
 */
bool getForecast()
{
  HTTPClient client;
  bool success = false;
  
  if (forecast_loaded == true && forecast_age_ms < FORECAST_REFRESH_MS)  
  {
    return true;  // forecast is still fresh - no need to load
  }
  
  if (!connectToWiFi(net_connect_timeout_sec))
  {
    return false;  // failed to connect to WiFi
  }

  client.begin(forecast_api_url);
  int16_t http_code = client.GET();

  if (http_code > 0) // success!
  { 
    String payload = client.getString();
    Serial.println(http_code);
    //Serial.println(payload);

    DeserializationError error = deserializeJson(json_doc, payload);
    if (!error) 
    {
      digitalWrite(ESP_LED, HIGH);
      Serial.println("JSON parsed successfully.");
      forecast_loaded = true;
      forecast_age_ms = 0; // reset age counter

      // testing
      const char* updated = json_doc["properties"]["updated"];  // should be a date-time string like 2019-11-06T23:49:22+00:00
      //float elevation = json_doc["properties"]["elevation"]["value"]; // 192.9384
      forecast_temp_f = json_doc["properties"]["periods"][0]["temperature"];  // TODO: put logic to check temp units first  
      
      Serial.print("Forecast updated: ");
      Serial.println(updated);
      success = true;
    }
    else
    {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.c_str());
    }
  }
  else
  {
    Serial.print("HTTP error: ");
    Serial.println(http_code);
    //digitalWrite(LED_1, HIGH);  // red=problem
  }
  client.end();
 
  digitalWrite(ESP_LED, LOW);
  WiFi.disconnect();
  return success;
}

/*
 * Retrieve the local time from the ESP32 internal RTC
 */
bool readControllerTime(struct ds3231_time_t *read_time)
{
  struct tm timeinfo;
  
  if(getLocalTime(&timeinfo))
  {
    /*
    Serial.print(timeinfo.tm_year);
    Serial.print("-");
    Serial.print(timeinfo.tm_mon);
    Serial.print("-");
    Serial.print(timeinfo.tm_mday);
    Serial.print("[");
    Serial.print(timeinfo.tm_wday);
    Serial.print("]");
    Serial.print(timeinfo.tm_hour);
    Serial.print(":");
    Serial.print(timeinfo.tm_min);
    Serial.print(":");
    Serial.println(timeinfo.tm_sec);
    */
   
    read_time->second = timeinfo.tm_sec;
    read_time->minute = timeinfo.tm_min;
    read_time->hour = timeinfo.tm_hour;
    read_time->dayOfWeek = timeinfo.tm_wday + 1;
    read_time->dayOfMonth = timeinfo.tm_mday;
    read_time->month = timeinfo.tm_mon + 1;
    read_time->year = timeinfo.tm_year % 100;
    return true;
  }
  return false;
}

/*
 * Set the ESP32's internal RTC based on the passed ds3231 time
 */
void setControllerTime(ds3231_time_t set_time)
{
    struct tm t;
    time_t time_now;

    t.tm_year = set_time.year + 100;  // Year - 1900
    t.tm_mon = set_time.month - 1;    // Month, where 0 = jan
    t.tm_mday = set_time.dayOfMonth;  // Day of the month
    t.tm_hour = set_time.hour;
    t.tm_min = set_time.minute;
    t.tm_sec = set_time.second;
    t.tm_isdst = 0;                   // Is DST on? 1 = yes, 0 = no, -1 = unknown
    
    time_now = mktime(&t);

    timeval epoch = {time_now, 0};
    settimeofday((const timeval*)&epoch, 0);

    Serial.println(time_now);

    // testing
    struct ds3231_time_t test_time;
    readControllerTime(&test_time);

