DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-time-weather/src/main.cpp
    Serial.print(rtc.getDayAbbr(test_time.dayOfWeek));
    Serial.print(", ");
    if (test_time.dayOfMonth < 10) Serial.print("0");
    Serial.print(test_time.dayOfMonth);
    Serial.print(" ");
    Serial.print(rtc.getMonthAbbr(test_time.month));
    Serial.print(" ");
    Serial.print("20");
    Serial.print(test_time.year); 
    Serial.print(" ");
    Serial.print(test_time.hour); 
    Serial.print(":");
    Serial.print(test_time.minute);
    Serial.print(":");
    Serial.println(test_time.second);
}

/*
 * Get the current time from the configured NTP server
 * and use it to set the ESP32 internal and DS3231 RTC time values
 */
bool getNtpTime()
{
  if (!connectToWiFi(net_connect_timeout_sec))
    return false;
  
  configTime(gmt_offset_sec, daylight_offset_sec, ntp_server); // from ESP32 Time library

  if (readControllerTime(&curr_time))
  {
    digitalWrite(ESP_LED, HIGH); // flash green=success
    rtc.setDS3231time(curr_time);
    digitalWrite(ESP_LED, LOW);
  }
  else
  {
    //digitalWrite(LED_1, HIGH); // red=problem
    Serial.println(F("Unable to retrieve controller time."));
  }
  WiFi.disconnect();
  return true;
}

/*
 * Initial set up for the Time and Sensor display mode
 */
void beginTimeAndSensor()
{
  tft.fillScreen(COLOR_SCREEN_BGD);
  tft.fillRect(0, 30, 320, 74, COLOR_TIME_BGD);  // time box

  if (wifi_available)
  {
    tft.drawRGBBitmap(302, 0, (uint16_t *)wifi_ico, 16, 11);
  }

  if (bme280_available)
  {
    tft.drawRGBBitmap(0, 0, (uint16_t *)thermometer_ico, 5, 13);
  }

  if (ds3231_available)
  {
    tft.drawRGBBitmap(12, 0, (uint16_t *)clock_ico, 12, 12);
  }

  

  // Initial time display
  tft.setFont(&FreeSansBold18pt7b);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_TIME, COLOR_TIME_BGD);
  tft.setCursor(98, 92);
  tft.print(":");
  tft.setCursor(194, 92);
  tft.print(":");

  // force redraw of all date, time, and sensor values
  for (int i = 0; i < 6; i++)
  {
    prev_time_digits[i] = 11;
  }
  prev_day = 0;
  prev_temp_f = 0;
  prev_temp_c = 0;
  prev_humid = 0;
  prev_pressure = 0;

  ds3231_available = rtc.readDS3231time(&curr_time);

  if (bme280_available)
  {  
    tft.drawLine(0, 180, 320, 180, COLOR_SENSOR_LINES);   // humidity / pressure
    tft.drawLine(160, 180, 160, 240, COLOR_SENSOR_LINES); // seperator lines
  }
  else if (forecast_loaded)
  {
    const char* short_forecast = json_doc["properties"]["periods"][0]["shortForecast"]; 

    curr_temp_f = json_doc["properties"]["periods"][0]["temperature"];
    curr_temp_c = (int16_t)((float)curr_temp_f - 32) / 1.8;
    
    tft.setFont(&FreeMonoBold12pt7b);
    tft.setTextColor(COLOR_FORECAST_BODY);
    tft.setTextSize(1);
    tft.setCursor(0, 200);
    TFT_drawWordWrap(short_forecast, 2, SCREEN_COLS_MONO12, &tft);  
  } 
}

/*
 * Update the screen for the Time and Sensor display mode
 */
void updateTimeAndSensor()
{
  int16_t x;

  // Get current time and temp values
  if (ds3231_available)
  {
    ds3231_available = rtc.readDS3231time(&curr_time);
  }
  else
  {
    readControllerTime(&curr_time);
  }
  currTimeToDigits();
  
  if (btn_pressed[BTN_UP])
  {
    tft_led_bright = (tft_led_bright > 10) ? tft_led_bright - 10 : 0;
    ledcWrite(TFT_LED_CHANNEL, tft_led_bright);
  }

  if (btn_pressed[BTN_DOWN])
  {
    tft_led_bright = (tft_led_bright < 245) ? tft_led_bright + 10 : 255;
    ledcWrite(TFT_LED_CHANNEL, tft_led_bright);
  }

  // Time
  tft.setFont(&FreeSansBold18pt7b);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_TIME, COLOR_TIME_BGD);
  tft.setCursor(20, 92);

  for (uint8_t i = 0; i < 6; i++)
  {
    x = TIME_DIGIT_X(i);
    if (prev_time_digits[i] != curr_time_digits[i])
    {
      tft.fillRect(x, 44, 38, 50, COLOR_TIME_BGD);
      tft.setCursor(x, 92);
      tft.print(curr_time_digits[i]);
    }
    prev_time_digits[i] = curr_time_digits[i];
  }

  tft.setFont(&FreeMonoBold12pt7b);
 
  // Date
  if (prev_day != curr_time.dayOfMonth)
  {
    tft.fillRect(50, 0, 250, 29, COLOR_SCREEN_BGD); // clear date
    tft.setTextSize(1);
    tft.setTextColor(COLOR_DATE);
    tft.setCursor(50, 18);
    tft.print(rtc.getDayAbbr(curr_time.dayOfWeek));
    tft.print(", ");
    if (curr_time.dayOfMonth < 10) tft.print("0");
    tft.print(curr_time.dayOfMonth);
    tft.print(" ");
    tft.print(rtc.getMonthAbbr(curr_time.month));
    tft.print(" ");
    tft.print("20");
    tft.print(curr_time.year); 

    prev_day = curr_time.dayOfMonth;
  }

  // Environmental 
  if (bme280_available)
  {
    tft.setTextColor(COLOR_SENSOR_TEMP);
    readBME280(); 
  }
  else
  {
    // just using forecast temp
    tft.setTextColor(COLOR_FORECAST_TEMP);
  }
   
  // Temperature
  if (prev_temp_f != curr_temp_f)
  {
    tft.fillRect(0, 128, 106, 38, COLOR_SCREEN_BGD);   // clear temperature F
    tft.fillRect(170, 128, 106, 38, COLOR_SCREEN_BGD); // clear temperature C

    x = 10 + (curr_temp_f < 100 ? 30 : 0) + (curr_temp_f < 10 ? 30 : 0) - (curr_temp_f < 0 ? 30 : 0) - (curr_temp_f <= -10 ? 30 : 0); 
    
    tft.setTextSize(2);
    tft.setCursor(x, 162);
    tft.print(curr_temp_f);
  
    tft.drawCircle(112, 138, 4, COLOR_SENSOR_TEMP);
    
    tft.setTextSize(1);
    tft.setCursor(124, 162);
    tft.print("F");
    
    prev_temp_f = curr_temp_f;

    if (forecast_loaded && prev_forecast_temp_f != forecast_temp_f)
    {
      if (bme280_available)
      {
        // Already howing sensor temp on left, now show forecast on right
        x = 180 + (forecast_temp_f < 100 ? 30 : 0) + (forecast_temp_f < 10 ? 30 : 0) - (forecast_temp_f < 0 ? 30 : 0) - (forecast_temp_f <= -10 ? 30 : 0);
        tft.setTextColor(COLOR_FORECAST_TEMP);
        tft.setTextSize(2);
        tft.setCursor(x, 162);
        tft.print(forecast_temp_f);
      
        tft.drawCircle(284, 138, 4, COLOR_FORECAST_TEMP);
      
        tft.setTextSize(1);
        tft.setCursor(296, 162);
        tft.print("F");

        // Indicate that the left value is from sensor, right is from forecast
        tft.setTextColor(COLOR_SENSOR_TEMP);
        tft.setCursor(124, 126);
        tft.print("in");

        tft.setTextColor(COLOR_FORECAST_TEMP);
        tft.setCursor(164, 126);
        tft.print("out");
      }
      else 
      {
        // No temp sensor available, so show forecast temp in C on right
        x = 180 + (curr_temp_c < 100 ? 30 : 0) + (curr_temp_c < 10 ? 30 : 0) - (curr_temp_c < 0 ? 30 : 0) - (curr_temp_c <= -10 ? 30 : 0);
        tft.setTextColor(COLOR_FORECAST_TEMP);
        tft.setTextSize(2);
        tft.setCursor(x, 162);
        tft.print(curr_temp_c);

        tft.drawCircle(284, 138, 4, COLOR_FORECAST_TEMP);
      
        tft.setTextSize(1);
        tft.setCursor(296, 162);
        tft.print("C");

        tft.setCursor(148, 126);
        tft.print("out");      
      }
        
