DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-time-weather/src/main.cpp
    }
    else if (!forecast_loaded)
    {
      // Display the BME sensor temperature in celsius
      x = 180 + (curr_temp_c < 100 ? 30 : 0) + (curr_temp_c < 10 ? 30 : 0) - (curr_temp_c < 0 ? 30 : 0) - (curr_temp_c <= -10 ? 30 : 0);
      tft.setTextSize(2);
      tft.setCursor(x, 162);
      tft.print(curr_temp_c);
    
      tft.drawCircle(284, 134, 4, COLOR_SENSOR_TEMP);
    
      tft.setTextSize(1);
      tft.setCursor(296, 158);
      tft.print("C");
      
      tft.setCursor(154, 126);
      tft.print("in");
    }
  } 

  if (!bme280_available)
  {
    // no humidity or pressure info available
    // short forecast is shown in this area instead
    return;
  }

  // Humidity
  if (prev_humid != curr_humid)
  {
    tft.fillRect(0, 190, 106, 50, COLOR_SCREEN_BGD);
    x = 10 + (curr_humid < 100 ? 30 : 0) + (curr_humid < 10 ? 30 : 0); 
    tft.setTextColor(COLOR_SENSOR_HUMID);
    tft.setTextSize(2);
    tft.setCursor(x, 230);
    tft.print(curr_humid);
  
    tft.setTextSize(1);
    tft.setCursor(112, 210);
    tft.print("%");
    
    tft.setCursor(112, 232);
    tft.print("Hum");

    prev_humid = curr_humid;
  }
  
  // Barometric pressure
  if (prev_pressure != curr_pressure)
  {
    tft.fillRect(170, 190, 106, 50, COLOR_SCREEN_BGD);

    x = 180 + (curr_pressure < 100 ? 30 : 0) + (curr_pressure < 10 ? 30 : 0); 
    tft.setTextColor(COLOR_SENSOR_PRESSURE);
    tft.setTextSize(2);
    tft.setCursor(x, 230);
    tft.print(curr_pressure);
  
    tft.setTextSize(1);
    tft.setCursor(284, 210);
    tft.print("in");
    tft.setCursor(284, 232);
    tft.print("Hg");

    prev_pressure = curr_pressure;
  }
}

/*
 * Initial set up for the Current Day Forecast display mode
 */
void beginDayForecast() 
{
  tft.fillScreen(COLOR_SCREEN_BGD);

  tft.setFont(&FreeMonoBold12pt7b);
  tft.setTextColor(COLOR_FORECAST_TITLE, COLOR_FORECAST_TITLE_BGD);
  tft.setTextSize(1);
  tft.setCursor(0, 50);

  if (!wifi_available) 
  {
    tft.print("WiFi not available");
    return;
  }

  if (forecast_loaded == false || forecast_age_ms >= FORECAST_REFRESH_MS)
  {
    
    tft.print("Getting Forecast...");
    
    bool success = getForecast();
  
    if (!success)
    {
      tft.setCursor(0, 40);
      tft.println("Unable to get forecast.");
      tft.println("Check internet connection.");
      return;
    }
  }
  
  // Display the forecast period title and body
  const char* period_name = json_doc["properties"]["periods"][0]["name"]; 
  const char* detailed_forecast = json_doc["properties"]["periods"][0]["detailedForecast"]; 
  
  tft.fillScreen(COLOR_SCREEN_BGD);
  tft.fillRect(0, 0, 320, 24, COLOR_FORECAST_TITLE_BGD);
  
  tft.setCursor(0, 20);
  TFT_drawTextUpper(period_name, &tft);  // i.e. TODAY, TONIGHT

  tft.setTextColor(COLOR_FORECAST_BODY);
  tft.setCursor(0, 50);

  TFT_drawWordWrap(detailed_forecast, 8, SCREEN_COLS_MONO12, &tft);
}

/*
 * Update the screen for the Current Day Forecast display mode
 */
void updateDayForecast() 
{
   
}

/*
 * Initial setup for the Tomorrow Forecast display mode
 */
void beginTomorrowForecast() 
{
  tft.fillScreen(COLOR_SCREEN_BGD);
  
  tft.fillRect(0, 0, 320, 24, COLOR_FORECAST_TITLE_BGD);
  tft.setFont(&FreeMonoBold12pt7b);
  tft.setTextColor(COLOR_FORECAST_TITLE, COLOR_FORECAST_TITLE_BGD);
  tft.setTextSize(1);

  const char* period_name = json_doc["properties"]["periods"][1]["name"]; 
  const char* detailed_forecast = json_doc["properties"]["periods"][1]["detailedForecast"]; 

  tft.setCursor(0, 20);
  TFT_drawTextUpper(period_name, &tft);

  tft.setTextColor(COLOR_FORECAST_BODY);
  tft.setCursor(0, 50);
  TFT_drawWordWrap(detailed_forecast, 9, SCREEN_COLS_MONO12, &tft);
}

/*
 * Update the screen for the Tomorrow Forecast display mode
 */
void updateTomorrowForecast() 
{
  
}

/*
 * Initial setup for the manual Set Time display mode 
 */
void beginSetTime() 
{
  tft.fillScreen(COLOR_SCREEN_BGD);

  tft.setFont(&FreeMonoBold12pt7b);
  tft.setTextColor(COLOR_DATE);
  tft.setTextSize(1);
  tft.setCursor(0, 20);
  tft.print("SET TIME");

  tft.setTextColor(COLOR_FORECAST_BODY);
  tft.setCursor(0, 160);
  tft.println("Use dir btns to change");
  tft.println("Press A to confirm");
  tft.println("X or Y to cancel");
  
  tft.fillRect(0, 30, 320, 80, COLOR_TIME_BGD);       // time box

  tft.setFont(&FreeSansBold18pt7b);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_TIME, COLOR_TIME_BGD);

  tft.setCursor(98, 92);
  tft.print(":");
  tft.setCursor(194, 92);
  tft.print(":");

  uint16_t x;
  for (uint8_t i = 0; i < 6; i++)
  {
    x = TIME_DIGIT_X(i);
    tft.fillRect(x, 44, 38, 50, COLOR_TIME_BGD);
    tft.setCursor(x, 92);
    tft.print(curr_time_digits[i]);
  }
}

/*
 * Update the screen for the manual Set Time display mode
 */
void updateSetTime() 
{
  static uint16_t edit_field, prev_edit_field;
  static uint16_t edit_x, edit_y;
  static bool     redraw;

  // TODO:  add date change functionality(?)

  prev_edit_field = edit_field;

  if (btn_released[BTN_LEFT])
  {
    edit_field = (edit_field > 0 ? edit_field - 1 : 0);
    redraw = true;
  }

  if (btn_released[BTN_RIGHT])
  {
    edit_field = (edit_field < 5 ? edit_field + 1 : 5);
    redraw = true;
  }

  if (btn_released[BTN_UP])
  {
    curr_time_digits[edit_field] = curr_time_digits[edit_field] + 1;
    redraw = true;
  }

  if (btn_released[BTN_DOWN])
  {
    curr_time_digits[edit_field] = curr_time_digits[edit_field] - 1;
    redraw = true;
  }

  if (redraw == true)
  {
    // Erase previous edit field highlight
    tft.fillRect(TIME_DIGIT_X(prev_edit_field), 44, 38, 50, COLOR_TIME_BGD);
    tft.setTextColor(COLOR_TIME, COLOR_TIME_EDIT);
    tft.setCursor(TIME_DIGIT_X(prev_edit_field), 92);
    tft.print(curr_time_digits[prev_edit_field]);

    // Draw new edit field highlight
    tft.setTextColor(COLOR_TIME_EDIT, COLOR_TIME);  // TODO!
    tft.setCursor(TIME_DIGIT_X(edit_field), 92);
    tft.print(curr_time_digits[edit_field]);    
  }

  if (btn_was_pressed[BTN_A])
  {
    // Commit the changes go back to time mode
    digitsToCurrTime();
    setControllerTime(curr_time);
    rtc.setDS3231time(curr_time);

    display_mode = MODE_TIME_AND_SENSOR;
  } 
}

