DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-time-weather/src/main.cpp
void checkButtonPresses()
{
  bool pressed = false;
  
  digitalWrite(SR_CP, LOW);
  digitalWrite(SR_PL, LOW);
  delay(5);
  digitalWrite(SR_PL, HIGH);

  for(uint8_t i = 0; i < 8; i++)
  {
    btn_was_pressed[i] = btn_pressed[i];  // track previous state
    pressed = (digitalRead(SR_Q7) == LOW ? 1: 0);// read the state of the SO:
    btn_released[i] = !pressed && btn_pressed[i];
    btn_pressed[i] = pressed;
    // Shift the next button pin value into the serial data out
    digitalWrite(SR_CP, LOW);
    delay(1);
    digitalWrite(SR_CP, HIGH);
    delay(1);
    //Serial.print(i); Serial.print(": "); Serial.print(btn_pressed[i]); Serial.print(" - "); Serial.println(btn_released[i]);
  }
}

/*
 * Main screen update logic.  Call on each loop.
 */
void updateScreen()
{
  if (prev_display_mode != display_mode)
  {
    // do the initial drawing of the screen for the new display mode
    switch (display_mode)
    {
      case MODE_TIME_AND_SENSOR: 
        beginTimeAndSensor();
        break;
        
      case MODE_DAY_FORECAST: 
        beginDayForecast();
        break;

      case MODE_TOMORROW_FORECAST: 
        beginTomorrowForecast();
        break;

      case MODE_SET_TIME: 
        beginSetTime();
        break;

      default:
        display_mode = MODE_TIME_AND_SENSOR;
        beginTimeAndSensor();
        break;    
    }
  }

  prev_display_mode = display_mode;
  
  // do the update for the current display mode
  switch (display_mode)
  {
    case MODE_TIME_AND_SENSOR: 
      updateTimeAndSensor();
      break;
      
    case MODE_DAY_FORECAST: 
      updateDayForecast();
      break;

    case MODE_TOMORROW_FORECAST: 
      updateTomorrowForecast();
      break;

    case MODE_SET_TIME: 
      updateSetTime();
      break;

    default:
      display_mode = MODE_TIME_AND_SENSOR;
      updateTimeAndSensor();
      break;    
  }
}

/*
 * Main program loop
 */
void loop(void)
{
  unsigned long start_time = millis();

  checkButtonPresses();

  if (btn_released[BTN_X])
  {
    display_mode = (display_mode_type)(display_mode > 0 ? display_mode - 1 : DISPLAY_MODE_CNT - 1);
  }

  if (btn_released[BTN_Y])
  {
    display_mode = (display_mode_type)((display_mode + 1) % DISPLAY_MODE_CNT);
  }

  updateScreen();
  delay(50);

  forecast_age_ms = forecast_age_ms +  millis() - start_time;
}
